[{"title": "CARNATION BREAKFAST ESSENTIALS HIGH PROTEIN Rich Milk Chocolate 12-8 fl. oz. Bottles", "tags": "On-the-Go Nutrition Diet Foods & Drinks Beach Body Ready Weight Management On the Go Busy Lifestyle Formats Carnation Breakfast Essentials High Protein Gain Supplements Gainers", "relevancy_score": 1799.517440776699, "price": "$14.38"}, {"title": "Atkins Gluten Free Protein-Rich Shake, Milk Chocolate Delight, Keto Friendly, 4 Count (Ready to Drink)", "tags": "Beach Body Ready Keto Weight Management for Active Moms Restock Indulgent Flavors Mom Basics Drinks", "relevancy_score": 1342.6257719626167, "price": "$5.98"}, {"title": "(6 Cans) Libby's Whole Kernel Corn, 15 oz cans", "tags": "Beans All Meals and Sides Fresh Vegetables Canned Tomatoes Cold Weather Foods Restock Easy Kid's Dinners", "relevancy_score": 1601.5947636363637, "price": "$3.96"}, {"title": "Frito-Lay Cheesy Mix Variety Pack, 18 Count", "tags": "All Grab and Go Sandwiches, Salads Snack Packs Salty Snacks Stock-Up Chips Potato Study Gaming & Drinks Summer Grilling", "relevancy_score": 232.29605925925927, "price": "$6.48"}, {"title": "(8 Pack) Nongshim Shin Ramyun Gourmet Spicy Noodle Soup, 4.2 oz", "tags": "Stocks & Broths Pasta Noodles All Meals and Sides Cold Weather Foods Restock Broth Asian Rice, Grains Shop Market", "relevancy_score": 699.67952, "price": "$7.68"}, {"title": "Wonderful Roasted & Salted Pistachios, 24 Oz", "tags": "Keto Indulgent Flavors Weight Management New & Trending Oatmeal Cereals Nuts Trail Mixes Seeds, Nut Butters On-the-Go Snacks Meal Replacement Bars", "relevancy_score": 1921.7366356164384, "price": "$9.94"}, {"title": "(2 pack) Maruchan Ramen Chicken Flavor, 12 ct, 3 oz", "tags": "Boxed Meals All and Sides Macaroni Cheese Cold Weather Foods Low Sodium Kid's Breakfast Restock Easy Dinners", "relevancy_score": 3481.871303816794, "price": "$5.04"}, {"title": "(4 Pack) Classico Tomato and Basil Pasta Sauce, 24 oz Jar", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Gluten Free Foods Restock Easy Kid's Dinners", "relevancy_score": 1338.8165197452229, "price": "$7.45"}, {"title": "(2 Pack) Great Value Chunk Chicken Breast in Water, 12.5 oz, 2 Count", "tags": "Canned Ready to Eat Meals Gluten-Free Foods No Sugar All Gametime Food chicken Chicken Breasts Game Time and Sides Easy Kid's Dinners", "relevancy_score": 3288.6617354838704, "price": "$7.72"}, {"title": "Great Value Deluxe Cashews, 30 oz", "tags": "All Nuts, Trail Mix,& Seeds On the Go Snacks Nuts Cashews Study Brain Foods Dried Fruits and Healthy Gaming & Drinks", "relevancy_score": 2434.0972460694697, "price": "$13.38"}, {"title": "CARNATION BREAKFAST ESSENTIALS HIGH PROTEIN Rich Milk Chocolate 12-8 fl. oz. Bottles", "tags": "On-the-Go Nutrition Diet Foods & Drinks Beach Body Ready Weight Management On the Go Busy Lifestyle Formats Carnation Breakfast Essentials High Protein Gain Supplements Gainers", "relevancy_score": 1799.517440776699, "price": "$14.38"}, {"title": "(3 Pack) Lipton Beefy Onion Soup and Dip Mix, 2.2 oz", "tags": "All Soup Lipton Green Tea Iced Bags Cold Weather Foods Chilled Dips", "relevancy_score": 1399.9333871559634, "price": "$4.56"}, {"title": "Great Value Chopped Pecans, 16 oz", "tags": "High Protein Snacks All Nuts, Trail Mix,& Seeds Nuts Dried Fruits and Healthy Walnuts Pecans", "relevancy_score": 290.96053333333333, "price": "$9.48"}, {"title": "Premier Protein Shake, Cookies & Cream, 30g Protein, 4 Ct", "tags": "Protein Shakes Eat High Diet Premier Shakes, Bars & Energy Drinks Fuel Your Body Add to Build Muscle Clears", "relevancy_score": 1972.94991790393, "price": "$7.47"}, {"title": "(4 pack) Progresso Vegetable Classics Lentil Soup, 19 oz Can", "tags": "Beans Prepared Foods All Meals and Sides Baked Cold Weather Canned Gluten Free & Side Dishes Easy Kid's Dinners", "relevancy_score": 606.4430514970061, "price": "$6.32"}, {"title": "(3 Pack) Barilla® Classic Marinara Tomato Pasta Sauce, 24 oz Jar", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Restock Gluten Free Side Dishes Easy Kid's Dinners", "relevancy_score": 553.8133217391305, "price": "$5.26"}, {"title": "Atkins Gluten Free Protein-Rich Shake, Café Caramel, Keto Friendly, 4 Count (Ready to Drink)", "tags": "Beach Body Ready Keto Weight Management for Active Moms Restock Indulgent Flavors Mom Basics Drinks", "relevancy_score": 2193.7775114624505, "price": "$34.99"}, {"title": "Jolly Time Select Premium Yellow Popcorn 30 Oz.", "tags": "Oil & Shortening Jolly Time Popcorn Orville Redenbacher's Seasoning All Gluten Free Snacks, Cookies Chips Bags Shop Plant Based Foods", "relevancy_score": 1209.1845534246575, "price": "$2.98"}, {"title": "Campbell's Condensed Chicken Noodle Soup, 10.75 oz. Can", "tags": "All Meals and Sides Cold Weather Foods Campbell's Condensed Soup Cereal Granola Bars", "relevancy_score": 675.2838454545454, "price": "$0.98"}, {"title": "Fritos Original Flavor Bean Dip, 9 Oz.", "tags": "Salty Snacks Stock-Up All Chilled Hummus, Dips and Salsas Fresh Packaged Salads, Dressings Gametime Food & Spreads Fritos", "relevancy_score": 868.6182579439253, "price": "$2.50"}, {"title": "(2 Pack) Old El Paso Soft Flour Tortilla Taco Boats, 8 Ct, 6.7 oz", "tags": "Boxed Meals No Sugar Foods Taco Seasoning All Mixed Spices & Seasonings Salt, General Mills Box Tops Easy Kid's Dinners", "relevancy_score": 496.9539555555556, "price": "$4.93"}, {"title": "Fritos Mild Cheddar Flavored Cheese Dip, 9 oz", "tags": "Salty Snacks Stock-Up Queso & Cheese Dips All Chilled Hummus, and Salsas Fresh Packaged Salads, Dressings Spreads Fritos", "relevancy_score": 629.2382457831325, "price": "$2.50"}, {"title": "(3 Pack) Great Value Premium Fully Cooked Chunk Chicken, 12.5 oz", "tags": "Meat & Poultry Canned Ready to Eat Meals Lunch Meats Gluten-Free Foods No Sugar Chicken Breasts All Deli Easy Kid's Dinners", "relevancy_score": 2469.8054219081273, "price": "$6.24"}, {"title": "(4 pack) Campbell's Chunky Soup, Baked Potato with Cheddar & Bacon Bits Soup, 18.8 Ounce Can", "tags": "Meat & Poultry Canned Ready to Eat Meals Boxed All and Sides Cold Weather Foods Gametime Food Game Time Easy Kid's Dinners", "relevancy_score": 622.8751448275862, "price": "$6.89"}, {"title": "Pace Salsa, Restaurant Style, Original Recipe, Medium Salsa, Perfect for Taco Night, 16 oz. Glass Jar", "tags": "Salty Snacks Stock-Up All Chilled Hummus, Dips and Salsas Fresh Packaged Salads, Dressings Low Calorie Foods Vegan & Spreads New Year's Eve Party Spread", "relevancy_score": 431.0397752066116, "price": "$1.98"}, {"title": "(4 Pack) Campbell's Chunky Grilled Chicken & Sausage Gumbo, 18.8 oz.", "tags": "Meat & Poultry Canned Ready to Eat Meals Boxed All and Sides Cold Weather Foods Gametime Food Game Time Easy Kid's Dinners", "relevancy_score": 971.3970285714286, "price": "$7.12"}, {"title": "(4 pack) Great Value Cream Of Chicken Condensed Soup, Family Size, 26 oz", "tags": "Meat & Poultry Canned Ready to Eat Meals Boxed All and Sides Tomatoes Cold Weather Foods Condensed Soup Easy Kid's Dinners", "relevancy_score": 466.9391157894737, "price": "$4.82"}, {"title": "(3 Pack) Dole Mandarin Oranges in 100% Fruit Juice, 23.5 oz", "tags": "Fruit Cups & Sauces Pie Fillings All Fresh Canned Pineapple Citrus Dole Peaches", "relevancy_score": 785.7746799999999, "price": "$9.54"}, {"title": "(5 Pack) Ragú Old World Style® Meat Pasta Sauce, 24 oz.", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Low Sodium Foods Gluten Free Side Dishes Easy Kid's Dinners", "relevancy_score": 336.1598, "price": "$6.89"}, {"title": "(2 Pack) Great Value Pizza Crusts, Original, 2 Count", "tags": "All Frozen Pizza Pie Fillings Sauces Pantry Clearance and Deals Low Calorie Foods Dairy Free Bacon, Hot Dogs Sausages Kosher", "relevancy_score": 210.09168372093023, "price": "$5.76"}, {"title": "Pace Chunky Salsa Medium, 16 oz.", "tags": "Salty Snacks Stock-Up All Chilled Hummus, Dips and Salsas Fresh Packaged Salads, Dressings Movie Night Foods Drinks Gluten Free Low Calorie & Spreads", "relevancy_score": 685.17952, "price": "$1.98"}, {"title": "Blue Diamond Almonds, Lightly Salted 14 oz", "tags": "All Nuts, Trail Mix,& Seeds Planters Cashews Blue Diamond Almonds Dried Fruits and Healthy Snacks Roasted", "relevancy_score": 532.6754086956522, "price": "$6.98"}, {"title": "Pillsbury Grands! Homestyle Buttermilk Biscuits, 16.3 oz", "tags": "All Cookies Shop Biscuits Chocolate Butter Frozen Bread", "relevancy_score": 191.81581369863017, "price": "$68.90"}, {"title": "(6 Kits) Bumble Bee Snack on the Run! Tuna Salad with Crackers, 3.5 oz", "tags": "All Grab and Go Sandwiches, Salads Snack Packs High Protein Food Staples Premade Canned Tuna Bumblebee Pouches Gluten Free Meals & Side Dishes", "relevancy_score": 398.89231724137926, "price": "$7.68"}, {"title": "Olive Garden Signature Italian Dressing 16 fl. oz. Bottle", "tags": "Ranch Dressing Condiments & Salad Italian All Fresh Packaged Salads, Dressings and Dips Caesar Specialty Shop Toppings Marinades", "relevancy_score": 430.52127058823527, "price": "$3.34"}, {"title": "Earth's Best Organic Stage 2, Apple Strawberry Baby Food, 4 oz. Pouch", "tags": "Toddler Foods Baby Food Pouches Earth's Best Organic Snack Time Top Brands Purees", "relevancy_score": 1247.1798173010382, "price": "$1.24"}, {"title": "(3 Pack) Jell-O Strawberry Gelatin Dessert, 6 oz Box", "tags": "Pudding & Gelatin Pie Fillings Valentine's Day Baking Sugar-Free Food Essentials All Mixes Ingredients Easter Cake", "relevancy_score": 1602.0807351351352, "price": "$4.23"}, {"title": "Entenmann’s Little Bites Fudge Brownies, 5 Pouches per Box", "tags": "Snack Cakes & Cupcakes All Cookies Muffins and Donuts Kid's Lunches", "relevancy_score": 242.01611707317073, "price": "$12.99"}, {"title": "Chef Boyardee Macaroni and Cheese, Microwavable Bowl, 7.5 Oz", "tags": "Canned Ready to Eat Meals Boxed All and Sides Tomatoes Macaroni Cheese Frozen Pasta Easy Kid's Dinners", "relevancy_score": 183.19046666666665, "price": "$0.98"}, {"title": "SPAM Classic Single Lunch Meat, 2.5 oz Pouch", "tags": "Tuna & Seafood Canned Beef Starkist chicken Packaged Salads Pouches Easy Kid's Dinners", "relevancy_score": 2908.230998425197, "price": "$1.13"}, {"title": "(4 pack) Progresso Light Beef Pot Roast Soup, 18.5 oz Can", "tags": "Meat & Poultry Canned Ready to Eat Meals All and Sides Cold Weather Foods Gametime Food Restock Game Time Easy Kid's Dinners", "relevancy_score": 548.9234748466257, "price": "$5.95"}, {"title": "(4 pack) Progresso Soup Reduced Sodium Roasted Chicken Noodle Soup 18.5 oz Can", "tags": "Meat & Poultry All Meals and Sides Cold Weather Foods Restock Gluten Free Side Dishes Game Time Easy Kid's Dinners", "relevancy_score": 512.0091636363636, "price": "$6.32"}, {"title": "Tostitos Medium Queso Blanco Dip, 15 oz Jar", "tags": "Salty Snacks Stock-Up Queso & Cheese Dips All Chilled Hummus, and Salsas Fresh Packaged Salads, Dressings Spreads", "relevancy_score": 454.19998749999996, "price": "$3.98"}, {"title": "Frito-Lay Fiery Mix Variety Pack, 18 Count", "tags": "All Grab and Go Sandwiches, Salads Snack Packs Salty Snacks Stock-Up Chips Potato Study Lunchbox Favorites Gaming & Drinks", "relevancy_score": 104.72856470588236, "price": "$6.48"}, {"title": "Great Value Roasted & Salted Almonds, 14 oz", "tags": "All Nuts, Trail Mix,& Seeds On the Go Snacks Blue Diamond Almonds Dried Fruits and Healthy Roasted", "relevancy_score": 661.6571294117647, "price": "$4.98"}, {"title": "Hostess Chocolate Ding Dongs, 10 count, 12.70 oz", "tags": "Cakes & Cupcakes All Cookies Shop Ice Cream Sandwiches Kid's Lunches Summer Grilling Snacks Snack", "relevancy_score": 355.2296727272727, "price": "$10.99"}, {"title": "(6 pack) Great Value Quartered Artichoke Hearts, 13.75 oz", "tags": "Beans Shop All Olives Fresh Vegetables Canned Tomatoes Vegan Foods Asparagus and Artichokes Easy Kid's Dinners", "relevancy_score": 327.1185614678899, "price": "$11.48"}, {"title": "(4 pack) Campbell's Condensed Cream of Celery Soup, 10.5 oz. Can", "tags": "Canned Ready to Eat Meals Soup Mixes All and Sides Tomatoes Cold Weather Foods Campbell's Condensed Restock", "relevancy_score": 394.80213333333336, "price": "$5.57"}, {"title": "(2 Pack) Chicken of the Sea Traditional Style Pink Salmon, 14.75 oz can", "tags": "Meat & Poultry Tuna Seafood No Sugar Foods High Protein Food Staples All Bumblebee Gluten Free Meals Side Dishes Easy Kid's Dinners", "relevancy_score": 1275.6231699059563, "price": "$7.96"}, {"title": "Tostitos Medium Salsa Con Queso, 23 oz Jar", "tags": "Salty Snacks Stock-Up All Chilled Hummus, Dips and Salsas Tostitos Fresh Packaged Salads, Dressings & Spreads", "relevancy_score": 1940.7454031042128, "price": "$4.98"}, {"title": "Pace Chunky Salsa Medium, 16 oz.", "tags": "Salty Snacks Stock-Up All Chilled Hummus, Dips and Salsas Fresh Packaged Salads, Dressings Movie Night Foods Drinks Gluten Free Low Calorie & Spreads", "relevancy_score": 685.17952, "price": "$1.98"}, {"title": "(4 pack) Progresso Soup Reduced Sodium Roasted Chicken Noodle Soup 18.5 oz Can", "tags": "Meat & Poultry All Meals and Sides Cold Weather Foods Restock Gluten Free Side Dishes Game Time Easy Kid's Dinners", "relevancy_score": 512.0091636363636, "price": "$6.32"}, {"title": "Mission Carb Balance Fajita Flour Tortillas, 8 Count", "tags": "Sandwich Breads No Sugar Foods Weight Management Bars Vegan On-The-Go New Year You General Mills Box Tops Meals Shop All Cold Packed Groceries", "relevancy_score": 43.1102, "price": "$9.88"}, {"title": "(4 pack) Campbell's Chunky Soup, Healthy Request Chicken Noodle Soup, 18.8 Ounce Can", "tags": "Meat & Poultry Canned Ready to Eat Meals All and Sides Cold Weather Foods Gametime Food Restock Condensed Soup Game Time", "relevancy_score": 498.02201379310344, "price": "$7.12"}, {"title": "Kraft Classic Ranch Dressing, 16 fl oz Bottle", "tags": "Condiments Ranch Dressing All Fresh Packaged Salads, Dressings and Dips Hidden Valley Paleo Food Essentials Summer Grilling Keto Gluten-Free Staples", "relevancy_score": 5508.339102290076, "price": "$1.98"}, {"title": "(6 pack) Hormel Compleats Dumplings & Chicken, 7.5 Ounce", "tags": "Meat & Poultry Canned Ready to Eat Meals Boxed All and Sides Macaroni Cheese Kid's Lunches Hormel Chili Easy Dinners", "relevancy_score": 779.9590358078602, "price": "$11.88"}, {"title": "(3 Pack) Ragú Simply™ Traditional Pasta Sauce, 24 oz.", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Vegan Foods Gluten Free Side Dishes Easy Kid's Dinners", "relevancy_score": 198.75442025316457, "price": "$4.44"}, {"title": "(6 Pack) Del Monte Fresh Cut Sweet Peas, 15 Oz", "tags": "Beans All Fresh Vegetables Canned Tomatoes Pre-Cut Corn Peas Meals Restock Gluten Free & Side Dishes", "relevancy_score": 237.95442025316456, "price": "$5.94"}, {"title": "(2 Pack) Bear Creek Country Kitchens(R0 Chicken Noodle Soup Mix 9.3 oz.", "tags": "Chili Canned Ready to Eat Meals All Soup Boxed and Sides Cold Weather Foods Nut Free", "relevancy_score": 712.143292146597, "price": "$5.74"}, {"title": "(3 Pack) Bumble Bee Snow's Chopped Clams, 6.5 oz Can", "tags": "Tuna & Seafood High Protein Food Staples Canned All Fresh Fish Pouches Gluten Free Meals Side Dishes", "relevancy_score": 448.90805581395347, "price": "$5.01"}, {"title": "(4 pack) Campbell's Condensed Healthy Request Homestyle Chicken Noodle Soup, 10.5 oz. Can", "tags": "All Meals and Sides Cold Weather Foods Campbell's Condensed Soup Restock Snack Crackers Game Time", "relevancy_score": 289.6768, "price": "$5.92"}, {"title": "(6 Pack) Allens Cut Italian Green Beans, 14.5 oz.", "tags": "Beans Canned Fruit All Fresh Vegetables Tomatoes Baked Cold Weather Foods Easy Kid's Dinners", "relevancy_score": 134.40353684210527, "price": "$6.98"}, {"title": "(4 pack) Campbell's Condensed Cream of Chicken with Herbs Soup, 10.5 oz. Can", "tags": "Boxed Meals All and Sides Cold Weather Foods Campbell's Condensed Soup Restock Potato Stuffing Game Time", "relevancy_score": 247.21611707317072, "price": "$5.57"}, {"title": "Campbell's Condensed Cheddar Cheese Soup, 10.5 oz. Can", "tags": "Stocks & Broths Soup Mixes All Meals and Sides Cold Weather Foods Campbell's Condensed Broth Non GMO Food", "relevancy_score": 127.01854545454546, "price": "$12.06"}, {"title": "Snack Pack Strawberry Juicy Gels, 4 Count", "tags": "Pudding & Gelatin Chilled Puddings All Grab and Go Sandwiches, Salads Snack Packs Sugar-Free Food Essentials Easter Meal Baking Ingredients Fat Free", "relevancy_score": 30.740133333333333, "price": "$1.00"}, {"title": "(4 pack) Barilla Pasta Medium Shells, 16.0 OZ", "tags": "Boxed Meals Sauces All and Sides Canned Tomatoes Pasta Sauce Low Sodium Foods Gluten Free & Side Dishes Easy Kid's Dinners", "relevancy_score": 200.41581369863013, "price": "$5.12"}, {"title": "Snack Pack Vanilla Pudding Cups, 4 Count", "tags": "Chilled Puddings Sugar-Free Food Essentials All Fresh Fruit Bananas Easter Meal Baking Ingredients Fat Free", "relevancy_score": 63.94462608695652, "price": "$1.00"}, {"title": "(2 Pack) Campbell's CondensedÂ Healthy Request Family Size Tomato Soup, 23.2 oz. Can", "tags": "Canned Ready to Eat Meals All and Sides Tomatoes Cold Weather Foods Campbell's Condensed Soup Nut Free Restock", "relevancy_score": 135.5827661016949, "price": "$5.28"}, {"title": "(4 pack) Campbell's Condensed Cream of Potato Soup, 10.5 oz. Can", "tags": "Canned Ready to Eat Meals Soup Mixes All and Sides Tomatoes Cold Weather Foods Campbell's Condensed Restock", "relevancy_score": 325.10856, "price": "$5.57"}, {"title": "(6 Pack) Le Sueur Very Young Small Sweet Peas, 8.5 oz", "tags": "Canned Fruit All Fresh Vegetables Tomatoes Baked Beans Cold Weather Foods Easy Kid's Dinners", "relevancy_score": 70.01298181818183, "price": "$17.20"}, {"title": "(3 Pack) Ken's Steakhouse Dressing, Buttermilk Ranch, 16 Fl Oz", "tags": "Ranch Dressing All Fresh Packaged Salads, Dressings and Dips Caesar Hidden Valley Paleo Food Essentials Gluten Free Foods Keto Gluten-Free Staples", "relevancy_score": 247.21611707317072, "price": "$7.09"}, {"title": "(4 Pack) BUSH'S Kidney Beans in a Mild Chili Sauce, 16 oz.", "tags": "Chili All Fresh Vegetables Canned Tomatoes Baked Beans Cold Weather Foods Mixed Spices & Seasonings High Fiber", "relevancy_score": 992.8970285714285, "price": "$5.52"}, {"title": "Hamburger Helper Cheesy Italian Shells Hamburger Helper 6.1 Oz", "tags": "Canned Ready to Eat Meals Beef Party Trays All and Sides Macaroni Cheese Kid's Lunches General Mills Box Tops Easy Dinners", "relevancy_score": 169.11856146788992, "price": "$1.24"}, {"title": "Hidden Valley Original Ranch Dips Mix, Gluten Free, Keto-Friendly - 4 Packets", "tags": "Condiments Shop All Salad Dressings Ranch Dressing Dry Paleo Food Essentials Chilled Dips Keto Gluten-Free Staples", "relevancy_score": 8598.966122869955, "price": "$4.98"}, {"title": "(12 Pack) Herdez Peppers - Chilpotle - Case Of 12 - 7 Oz, 7 Oz", "tags": "All Fresh Vegetables Chilled Hummus, Dips and Salsas & Spreads Salsa Latin American Sauces, Condiments Cooking Needs", "relevancy_score": 483.08235395683454, "price": "$10.54"}, {"title": "(4 pack) Lipton Onion Mushroom Soup and Dip Mix, 1.8 oz", "tags": "", "relevancy_score": 468.0238229007633, "price": "$6.08"}, {"title": "Sunbelt Bakery Chewy Granola Bars, Fudge Dipped Coconut, 10 Ct, 10.21 Oz", "tags": "Cereal Bars & Breakfast Shop Nature Valley Great Value Snack Granola Low Sodium Foods Gaming Snacks Drinks", "relevancy_score": 218.91061818181817, "price": "$13.55"}, {"title": "Great Value Dried Figs, Mission, 7 oz", "tags": "Dried Fruits and Vegetables Figs All Fruit Types Nuts, Healthy Snacks Made in Nature New Apricots Organic", "relevancy_score": 822.8123849056603, "price": "$1.98"}, {"title": "Good Seasons Italian All Natural Salad Dressing & Recipe Mix, 4 - 0.7 oz Packets", "tags": "Dry Salad Dressing Italian All Fresh Packaged Salads, Dressings and Dips Hidden Valley Ranch Nut Free Foods Kid's Breakfast Seasoning Chilled", "relevancy_score": 747.7206702702703, "price": "$4.37"}, {"title": "(4 pack) Progresso Traditional Chicken and Sausage Gumbo Soup, 19 oz", "tags": "Meat & Poultry Canned Ready to Eat Meals Prepared Foods All and Sides Cold Weather Gametime Food Game Time Easy Kid's Dinners", "relevancy_score": 420.4917921259842, "price": "$6.32"}, {"title": "(2 Pack) Bella Sun Luci Julienne Cut Sun Dried Tomatoes with Italian Herbs, 8.5 oz", "tags": "Shop All Olives Sauces Fresh Vegetables Canned Tomatoes Pasta Sauce Vegan Foods Nuts, Dried Fruits and Healthy Snacks Easy Kid's Dinners", "relevancy_score": 232.49168372093018, "price": "$7.14"}, {"title": "Blue Diamond Almonds, Lightly Salted Almonds, 6 Oz", "tags": "All Nuts, Trail Mix,& Seeds Nuts Planters Cashews Almonds Dried Fruits and Healthy Snacks Roasted Mixed", "relevancy_score": 464.1834666666666, "price": "$2.96"}, {"title": "(6 pack) Hormel Compleats Rice & Chicken, 7.5 Ounce", "tags": "Meat & Poultry Canned Ready to Eat Meals Boxed All and Sides Macaroni Cheese Hormel Chili Easy Kid's Dinners", "relevancy_score": 900.7399578947368, "price": "$11.88"}, {"title": "Snack Pack Butterscotch Pudding Cups 4 Count", "tags": "Chilled Puddings Sugar-Free Food Essentials All Fresh Fruit Bananas Easter Meal Baking Ingredients Fat Free", "relevancy_score": 175.22225454545452, "price": "$1.00"}, {"title": "(4 pack) Campbell's Chunky Soup, Healthy Request Grilled Chicken & Sausage Gumbo, 18.8 Ounce Can", "tags": "Meat & Poultry Canned Ready to Eat Meals All and Sides Cold Weather Foods Gametime Food Condensed Soup Pasta Game Time", "relevancy_score": 347.2296727272727, "price": "$6.70"}, {"title": "(2 Pack) Great Value Large Lima Beans, 16 oz", "tags": "Beans All Fresh Vegetables Low Sodium Foods Vegan Meals Restock Kosher High Fiber", "relevancy_score": 312.73468235294115, "price": "$4.58"}, {"title": "Great Value Freeze Dried Fruit Crisps, Variety Pack, 6 ct, 0.4 oz", "tags": "Fruit Chips and Crisps Freeze Dried Trail Mixes Healthy Snacks Fruits Vegetables All Types Nuts, Brothers Natural Mix", "relevancy_score": 73.92194285714285, "price": "$4.48"}, {"title": "BIGS Vlasic Dill Pickle Sunflower Seeds 5.35-oz. Bag", "tags": "All Nuts, Trail Mix,& Seeds Nuts Granola Bars Pumpkin Dried Fruits and Healthy Snacks On-The-Go New Year You Foods Fiber One Breakfast & Snack", "relevancy_score": 170.21001739130435, "price": "$1.58"}, {"title": "Muscle Milk Genuine Protein Shake, 25g Protein, Chocolate, 11 Fl Oz, 4 Count", "tags": "Eat High Protein Diet Shakes, Bars & Energy Drinks On the Go Fuel Your Body Muscle Milk Shake Add to Build All Supplements", "relevancy_score": 629.1524923076923, "price": "$5.77"}, {"title": "Herdez Guacamole Salsa, Medium, 15.7 Oz", "tags": "All Fresh Packaged Salads, Dressings and Dips Salsas Pace Salsa & Spreads Latin American Sauces, Condiments Cooking Needs", "relevancy_score": 522.3234748466257, "price": "$2.38"}, {"title": "(8 Pack) Pasta Roni Garlic & Olive Oil Vermicelli, 4.6 oz. Box", "tags": "Canned Ready to Eat Meals Boxed Pasta & Noodles All and Sides Knorr Uncle Ben's Kid's Lunches", "relevancy_score": 322.6813714285714, "price": "$7.30"}, {"title": "Frito-Lay Originals Mix Variety Pack, 18 Count", "tags": "All Grab and Go Sandwiches, Salads Snack Packs Salty Snacks Stock-Up Chips Mixes Study Lunchbox Favorites On-the-go Crackers", "relevancy_score": 175.22225454545452, "price": "$6.98"}, {"title": "Jell-O Sugar Free Strawberry Instant Gelatin Mix, 0.3 oz Box", "tags": "Pudding & Gelatin Sugar-Free Food Essentials All Fresh Fruit Sugar Free Bananas Snacks Baking Ingredients Easter", "relevancy_score": 251.9356915662651, "price": "$0.98"}, {"title": "Hidden Valley Original Ranch Salad Dressing To Go Cups - 1.5 Ounces Each - 8 Count", "tags": "Shop All Salad Dressings Ranch Dressing Fresh Packaged Salads, and Dips Hidden Valley Paleo Food Essentials Keto Gluten-Free Staples", "relevancy_score": 48411.52735525281, "price": "$4.16"}, {"title": "Betty Crocker Cheddar and Bacon Potatoes, 5.1 oz Box", "tags": "Canned Ready to Eat Meals All and Sides Macaroni Cheese Knorr Gluten Free Foods Kid's Lunches Gluten-Free Food Staples Easy Dinners", "relevancy_score": 36.934905263157894, "price": "$1.24"}, {"title": "(4 pack) Campbell's Chicken Noodle Soup Microwavable Bowl, 15.4 oz.", "tags": "Boxed Meals Soup Mixes All and Sides Canned Tomatoes Cold Weather Foods Campbell's Condensed Restock", "relevancy_score": 247.21611707317072, "price": "$6.72"}, {"title": "Blue Diamond Bold Wasabi & Soy Sauce Almonds, 6 oz", "tags": "All Nuts, Trail Mix,& Seeds Nuts Planters Cashews Plant-Based Milk Almonds Dried Fruits and Healthy Snacks Mixed", "relevancy_score": 411.2823304347826, "price": "$2.96"}, {"title": "Great Value Cinnamon Roasted Almonds, 14 oz", "tags": "All Nuts, Trail Mix,& Seeds On the Go Snacks Planters Cashews Almonds Dried Fruits and Healthy Roasted", "relevancy_score": 859.2123849056603, "price": "$4.97"}, {"title": "Planters Mixed Nuts, 10.3 oz Canister", "tags": "Trail Mixes and Healthy Snacks All Nuts, Mix,& Seeds On the Go Nuts Dried Fruits Mix Mixed Wonderful Pistachios", "relevancy_score": 1682.6102193548388, "price": "$4.38"}, {"title": "(6 Pack) Betty Crocker Tuna Helper Tetrazzini, 7.3 oz Box", "tags": "Canned Ready to Eat Meals Party Trays All and Sides Macaroni Cheese Kid's Lunches General Mills Box Tops Easy Dinners", "relevancy_score": 292.89510303030306, "price": "$6.88"}, {"title": "(6 Pack) Dole Pineapple Chunks in Heavy Syrup, 20 oz Can", "tags": "Fruit Cups & Sauces Pie Fillings Tropical Fruits Canned Pineapple Citrus Dole Peaches", "relevancy_score": 319.9346823529412, "price": "$8.48"}, {"title": "Jell-O Berry Blue Instant Gelatin Mix, 3 oz Box", "tags": "Pudding & Gelatin Valentine's Day Baking Sugar-Free Food Essentials All Fresh Fruit Sugar Free Bananas Ingredients Easter", "relevancy_score": 3529.27, "price": "$0.80"}, {"title": "(6 Pack) Newman's Own Organics Pasta Sauce Marinara, 23.5 OZ", "tags": "Sauces Organic Foods All Meals and Sides Canned Tomatoes Pasta Sauce Food Essentials Gluten Free & Side Dishes Easy Kid's Dinners", "relevancy_score": 126.2568, "price": "$15.97"}, {"title": "(3 Kits) Bumble Bee Snack on the Run Chicken Salad with Crackers, 3.5 oz", "tags": "Tuna & Seafood All Grab and Go Sandwiches, Salads Snack Packs High Protein Food Staples Premade Canned Bumblebee Packaged Pouches", "relevancy_score": 355.672, "price": "$3.64"}, {"title": "(4 pack) Progresso Vegetable Classic Vegetarian Vegetable and Barley Soup 19 oz", "tags": "Prepared Foods All Meals and Sides Organic Food Essentials Cold Weather Vegan Shop Plant Based Gluten Free & Side Dishes", "relevancy_score": 223.53279999999998, "price": "$6.32"}, {"title": "King's Hawaiian Sliced Bread, Original Hawaiian Sweet Sliced Loaf, 16 oz", "tags": "Sandwich Breads Dessert Tortillas, Pitas & Wraps Bread Crumbs Stuffing Croutons Baguettes, Loaves Breadsticks Kosher Specialty Frozen", "relevancy_score": 383.9405837837838, "price": "$15.45"}, {"title": "Great Value Instant Nonfat Dry Milk, 64 oz", "tags": "Organic Milk Whole Powdered Kid's Breakfast Flavored Milks Kosher Foods Carnation", "relevancy_score": 2396.493631168831, "price": "$15.98"}, {"title": "(4 Pack) Idahoan Steakhouse Loaded Potato Soup Mix, 7.1 oz", "tags": "Canned Ready to Eat Meals Boxed Soup Mixes All and Sides Cold Weather Foods Nut Free Gluten-Free Food Staples", "relevancy_score": 266.8734588235294, "price": "$9.99"}, {"title": "Super Snack Pack Vanilla Pudding Cups, 6 Count", "tags": "Canned Fruit Applesauce Cups & Sauces Chilled Puddings All Grab and Go Sandwiches, Salads Snack Packs Sugar-Free Food Essentials Dole pouches", "relevancy_score": 437.7238229007633, "price": "$2.48"}, {"title": "(4 pack) Campbell's Condensed Healthy Request Vegetable Beef Soup, 10.5 oz. Can", "tags": "Canned Ready to Eat Meals All and Sides Tomatoes Cold Weather Foods Campbell's Condensed Soup Restock Pasta", "relevancy_score": 178.8644056338028, "price": "$5.57"}, {"title": "Kodiak Cakes Muffin Unleashed, Blueberry Muffin in a Cup, 2.29 Oz", "tags": "Muffin Mixes All Baking High Protein Food Staples Better For You Essentials Dessert Healthy Non GMO", "relevancy_score": 20.52244705882353, "price": "$1.78"}, {"title": "(3 Pack) Ken's Steakhouse Dressing, Country French with Orange Blossom Honey, 16 Fl Oz", "tags": "Ranch Dressing Thousand Island All Fresh Packaged Salads, Dressings and Dips Caesar Specialty Gluten Free Foods French & Marinades", "relevancy_score": 237.71061818181818, "price": "$7.09"}, {"title": "Jell-O Raspberry Instant Gelatin Mix, 3 oz Box", "tags": "Pudding & Gelatin Valentine's Day Baking Chilled Puddings Sugar-Free Food Essentials Sugar Free Jolly Rancher Ingredients Easter", "relevancy_score": 507.4539555555556, "price": "$0.80"}, {"title": "Wild Planet Wild Albacore Tuna 5 Oz Can", "tags": "Tuna & Seafood All Fresh Fish Bumblebee Pouches Gluten Free Meals Side Dishes Easy Kid's Dinners", "relevancy_score": 99.77632, "price": "$3.86"}, {"title": "Ocean Spray Craisins Dried Cranberries, Reduced Sugar, 5oz Resealable Pouch", "tags": "Berries Dried Cranberries Craisins Fruits and Vegetables All Fruit Types Nuts, Healthy Snacks Raisins Organic", "relevancy_score": 176.61061818181818, "price": "$1.66"}, {"title": "Carnation Breakfast Essentials Ready to Drink Nutritional Breakfast Drink, Classic French Vanilla, 6 - 8 FL OZ Bottles", "tags": "On-the-Go Nutrition Beach Body Ready Weight Management On the Go Carnation Breakfast Essentials Powder Busy Lifestyle Formats High Protein Gain Supplements Gainers", "relevancy_score": 1456.3478088495574, "price": "$5.98"}, {"title": "(4 pack) Campbell's Condensed Healthy Request Chicken Noodle Soup, 10.75 oz. Can", "tags": "Meat & Poultry Canned Ready to Eat Meals All and Sides Cold Weather Foods Campbell's Condensed Soup Restock Game Time", "relevancy_score": 352.78396981132073, "price": "$4.48"}, {"title": "(3 Pack) Barilla Pasta Sauce, Traditional, 24 Oz", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Restock Gluten Free Side Dishes Easy Kid's Dinners", "relevancy_score": 205.16448, "price": "$5.26"}, {"title": "Great Value Dry Roasted Almonds, Lightly Salted with Sea Salt, 25 Oz", "tags": "All Nuts, Trail Mix,& Seeds On the Go Snacks Planters Cashews Blue Diamond Almonds Dried Fruits and Healthy Roasted", "relevancy_score": 550.7156333333332, "price": "$8.84"}, {"title": "(2 Pack) Old El Paso Restaurant Grande Shells 6 Count, 21.5 oz", "tags": "Boxed Meals No Sugar Foods Taco Seasoning All Mixed Spices & Seasonings Dips Spreads Salt, General Mills Box Tops", "relevancy_score": 364.0513, "price": "$5.30"}, {"title": "Power Up 14oz Mega Omega Trail Mix, Gluten Free, Vegan, and Non-GMO", "tags": "Trail Mixes and Healthy Snacks All Nuts, Mix,& Seeds Nuts Planters Cashews Dried Fruits Mix", "relevancy_score": 627.60815, "price": "$4.98"}, {"title": "Great Value Omega-3 Trail Mix, 1.75 oz, 8 Count", "tags": "Trail Mixes and Healthy Snacks All Nuts, Mix,& Seeds Nuts Planters Cashews Dried Fruits Mix", "relevancy_score": 218.2404756756757, "price": "$6.87"}, {"title": "(4 Pack) Bush's Best Black Beans, 26.5 Oz", "tags": "All Fresh Vegetables Canned Tomatoes Black Beans Baked Cold Weather Foods Game Time Meals and Sides Easy Kid's Dinners", "relevancy_score": 398.89231724137926, "price": "$6.32"}, {"title": "Emerald Nuts Natural Almonds, 100 Calorie Packs, 10 Ct", "tags": "Nuts Planters Cashews All Almonds Nuts, Dried Fruits and Healthy Snacks On-The-Go Mixed", "relevancy_score": 146.2204, "price": "$4.74"}, {"title": "Campbell's Chunky Soup, Savory Chicken with White & Wild Rice Soup, 18.8 Ounce Can", "tags": "Canned Ready to Eat Meals All and Sides Cold Weather Foods Campbell's Condensed Soup Gametime Food Restock Game Time", "relevancy_score": 200.64047567567567, "price": "$1.78"}, {"title": "(3 Pack) Jell-O Lime Gelatin Mix, 6 oz Box", "tags": "Pudding & Gelatin Pie Fillings Valentine's Day Baking Sugar-Free Food Essentials Sugar Free All Mixes Ingredients Easter", "relevancy_score": 1517.4623227272727, "price": "$3.37"}, {"title": "(4 Pack) Amy's Organic Black Bean Chili, 14.7 oz", "tags": "Chili All Soup Fresh Vegetables Organic Food Essentials Canned Beans Vegan Shop Plant Based Foods Gluten Free Meals & Side Dishes", "relevancy_score": 226.4161170731707, "price": "$10.84"}, {"title": "Skinnygirl™ Buttermilk Ranch Fat Free/Sugar Free Salad Dressing 8 fl. oz. Bottle", "tags": "Shop All Salad Dressings Ranch Dressing Condiments & Fresh Packaged Salads, and Dips Hidden Valley Low Calorie Foods Gluten-Free Food Staples Tessemaes", "relevancy_score": 53.02194285714286, "price": "$1.98"}, {"title": "BIGS Hidden Valley Ranch Sunflower Seeds, 5.35-oz. Bag", "tags": "Beans Dried All Nuts, Trail Mix,& Seeds Nuts Pumpkin Fruits and Healthy Snacks", "relevancy_score": 32.934905263157894, "price": "$1.58"}, {"title": "Emerald Nuts Natural Walnuts and Almonds, 100 Calorie Packs, 10 Ct", "tags": "All Nuts, Trail Mix,& Seeds Nuts Dried Fruits and Healthy Snacks On-The-Go New Year You Foods Mixed", "relevancy_score": 151.95917500000002, "price": "$4.74"}, {"title": "Mission Carb Balance Fajita Whole Wheat Tortillas, 8 Count", "tags": "Gluten-Free Foods All Fresh Fruit No Sugar Bananas Weight Management Bars Vegan Heavy & Light Creams", "relevancy_score": 71.98026666666667, "price": "$9.88"}, {"title": "La Banderita Yellow Corn 6\" Tortillas, 30 ct", "tags": "Gluten-Free Foods No Sugar Gluten Free Nut Low Sodium Vegan Dairy General Mills Box Tops Meals", "relevancy_score": 46.86879999999999, "price": "$1.77"}, {"title": "(4 Pack) Bumble Bee Sun-Dried Tomato & Basil Seasoned Tuna, 2.5 oz Pouch", "tags": "Tuna & Seafood All Canned Goods Fresh Fish Bumblebee Pouches", "relevancy_score": 0.0, "price": "$4.97"}, {"title": "(3 Pack) Campbell's Slow Kettle Style Roasted Chicken Noodle Soup with Herbs & White Meat Chicken, 15.5 oz. Tub", "tags": "Soup Mixes All Meals and Sides Canned Tomatoes Cold Weather Foods Campbell's Condensed Nut Free Soups, Stocks & Broths Game Time", "relevancy_score": 66.20624680851063, "price": "$8.52"}, {"title": "(3 Pack) Frontera Mild Texas Original Taco Skillet Sauce with Mild Red Chile + Cumin, 8 oz", "tags": "Boxed Meals Asian Sauces Canned Tomatoes Pasta Sauce All Pantry Clearance and Deals Snacks Gravies Easy Kid's Dinners", "relevancy_score": 68.98026666666667, "price": "$5.66"}, {"title": "Muscle Milk Pro Series Protein Shake, 32g Protein, Knockout Chocolate, 11 Fl Oz, 4 Count", "tags": "Eat High Protein Diet Shakes, Bars & Energy Drinks Fuel Your Workout On the Go Body Muscle Milk Shake Add to Build", "relevancy_score": 412.8397752066116, "price": "$6.96"}, {"title": "Jell-O Sugar Free Ready Vanilla Pudding Cups, 4 ct - 14.5 oz Package", "tags": "Pudding & Gelatin Sugar-Free Food Essentials Sugar Free Game Time Baking Dessert Mixes All Healthy Keto Fat", "relevancy_score": 520.4892, "price": "$58.90"}, {"title": "SKIPPY Natural Super Chunk Peanut Butter Spread, 40 Ounce", "tags": "Skippy Peanut Butter Natural and Jelly All Chunky Jif Creamy", "relevancy_score": 7010.856852930056, "price": "$5.44"}, {"title": "Briannas Home Style Asiago Caesar Dressing, 12 fl oz", "tags": "Shop All Salad Dressings Ranch Dressing Condiments & Fresh Packaged Salads, and Dips Primal Kitchen Specialty Balsamic Marinades", "relevancy_score": 157.42613333333333, "price": "$3.12"}, {"title": "Campbell's Well Yes! Sipping Soup, Vegetable Soup On The Go, Creamy Cauliflower & Potato, 11.1 Ounce Cup", "tags": "Stocks & Broths Soup Mixes All Meals and Sides Canned Tomatoes Cold Weather Foods Soups, Broth Non GMO Food", "relevancy_score": 943.9380679245284, "price": "$1.68"}, {"title": "(2 Pack) Classico Tomato and Basil Pasta Sauce, 44 oz Jar", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Gluten Free Foods Side Dishes Easy Kid's Dinners", "relevancy_score": 804.1877411764706, "price": "$6.48"}, {"title": "(4 Pack) Cento Peeled Tomatoes, Italian Style, 28 Oz", "tags": "Other International Foods All Fresh Vegetables Tomatoes Canned Pasta Sauce Vegan Meals Restock Easy Kid's Dinners", "relevancy_score": 182.08785263157895, "price": "$7.41"}, {"title": "(4 Pack) Classico Spicy Tomato and Basil Pasta Sauce, 24 oz Jar", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Gluten Free Foods Restock Easy Kid's Dinners", "relevancy_score": 331.6473631067961, "price": "$7.45"}, {"title": "Kellogg's Special K, Protein Shakes, Strawberry, 4 Ct, 40 Fl Oz", "tags": "Eat High Protein Diet Special K Shakes Shakes, Bars & Energy Drinks Soy On the Go Fuel Your Body Add to Build Muscle", "relevancy_score": 493.9823539568345, "price": "$5.56"}, {"title": "(4 Pack) Good Seasons Garlic & Herb Salad Dressing & Recipe Mix, 0.75 Oz Envelope", "tags": "Shop All Salad Dressings Cold Packed Premium Chocolates Chocolate Truffles Fresh Packaged Salads, and Dips Nut Free Foods Dark Lindt Dairy", "relevancy_score": 346.10856, "price": "$5.52"}, {"title": "Pop-Tarts, Crisps, Frosted Strawberrylicious, 12 Ct, 5.9 Oz", "tags": "Treat Yourself Pop-Tarts Toaster Pastries New and Limited Time Only Bites Classic Kellogg's PWS Brand Amplifier Shop Kids Crisps", "relevancy_score": 196.11581369863015, "price": "$2.98"}, {"title": "Fresh Gourmet Wonton Strips, Garlic Ginger, 3.5 oz", "tags": "Soup Mixes Asian Snacks Trail and Healthy All Fresh Packaged Salads, Dressings Dips Hidden Valley Ranch Salad Toppings Shop Market", "relevancy_score": 61.142567441860464, "price": "$32.37"}, {"title": "Atkins Gluten Free Protein-Rich Shake, Dark Chocolate Royale, Keto Friendly, 8 Count (Ready to Drink)", "tags": "Beach Body Ready Keto Weight Management for Active Moms Restock Indulgent Flavors Mom Basics Drinks", "relevancy_score": 1224.063294623656, "price": "$11.48"}, {"title": "Starburst Strawberry (All Pink) Gelatin, 6 serve", "tags": "Pudding & Gelatin Valentine's Day Baking Chilled Puddings All Grab and Go Sandwiches, Salads Snack Packs Ingredients Powdered Drink Mix Easter Starburst", "relevancy_score": 89.12194285714284, "price": "$1.22"}, {"title": "NESQUIK Chocolate Lowfat Milk", "tags": "Organic Foods Milk Almond Plant-Based Horizon Flavored Milks Plant Based Beverages", "relevancy_score": 338.94736310679605, "price": "$9.48"}, {"title": "Snack Pack Sugar-Free Vanilla Pudding Cups 4 Count", "tags": "Chilled Puddings Sugar-Free Food Essentials Jerky Deals! Slim Jims Easter Meal Baking Ingredients Fat Free", "relevancy_score": 119.2204, "price": "$0.94"}, {"title": "(5 Pack) Suddenly Salad Creamy Parmesan Pasta Salad Dry Meals 6.2 Oz", "tags": "Boxed Meals All and Sides Macaroni Cheese Hidden Valley Ranch Kid's Lunches General Mills Box Tops Easy Dinners", "relevancy_score": 195.79046666666665, "price": "$10.62"}, {"title": "Blue Diamond Bold Habanero BBQ Almonds, 6 oz", "tags": "Oil & Shortening All Nuts, Trail Mix,& Seeds Nuts Planters Cashews Almonds Dried Fruits and Healthy Snacks", "relevancy_score": 233.05442025316458, "price": "$10.95"}, {"title": "Great Value Roasted & Salted Mixed Nuts, 14.75 oz", "tags": "Trail Mixes and Healthy Snacks All Nuts, Mix,& Seeds Planters Cashews Dried Fruits Mix Mixed Nuts Wonderful Pistachios", "relevancy_score": 236.0356915662651, "price": "$5.14"}, {"title": "(3 Pack) PLAIN PASTA SAUCE", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Gluten Free Foods Side Dishes Easy Kid's Dinners", "relevancy_score": 376.76182654867256, "price": "$4.98"}, {"title": "(4 pack) Great Value Mayocoba Beans, 16 oz", "tags": "", "relevancy_score": 89.12194285714284, "price": "$5.57"}, {"title": "Planters Mixed Nuts, Lightly Salted, 56.0 oz Canister", "tags": "All Nuts, Trail Mix,& Seeds On the Go Snacks Planters Cashews Dried Fruits and Healthy Mix Mixed Nuts Wonderful Pistachios", "relevancy_score": 1878.5486421052633, "price": "$16.98"}, {"title": "(2 Pack) Chicken of The Sea Wild Skinless Boneless Smoked Salmon, 3 oz Pouch", "tags": "High Protein Food Staples Canned Tuna All Seafood Fresh Fish Bumblebee Pouches Gluten Free Meals & Side Dishes", "relevancy_score": 227.19605925925927, "price": "$5.94"}, {"title": "(6 Cans) Del Monte Sweet Peas 15 oz", "tags": "Beans Canned Fruit All Fresh Vegetables Tomatoes Baked Meals Restock Easy Kid's Dinners", "relevancy_score": 809.3033645933015, "price": "$5.70"}, {"title": "Schär Gluten Free Pizza Crust, 10.6 Oz, 2-Count", "tags": "All Frozen Pizza Croutons Gluten Free Snacks, Cookies & Chips Snacks Non GMO Food Gluten-Free Staples Crackers Bread", "relevancy_score": 98.52713962264151, "price": "$6.72"}, {"title": "(2 Pack) Zatarain's Concentrated Shrimp & Crab Boil, 4 fl oz", "tags": "Coatings & Batters Baking Restock All Mixed Spices Seasonings Seafood Fresh Fish Salt, Seasoning Cajun", "relevancy_score": 58.54256744186047, "price": "$3.96"}, {"title": "Wonderful Pistachios, Salt & Pepper Flavor, 7 Ounce Resealable Pouch", "tags": "High Protein Snacks All Nuts, Trail Mix,& Seeds Keto Study Brain Foods Dried Fruits and Healthy Pistachios Wonderful", "relevancy_score": 76.48026666666667, "price": "$4.46"}, {"title": "Premier Protein Protein Shake, Cafe Latte, 30g Protein, 11 fl oz, 12 Ct", "tags": "Shakes High Protein Drinks On-The-Go & Electrolytes Functional Beverages New Year You Foods Weight Management", "relevancy_score": 3474.663875697211, "price": "$22.41"}, {"title": "Wish-Bone Russian Dressing 15 FL OZ", "tags": "Ranch Dressing Thousand Island Italian All Fresh Packaged Salads, Dressings and Dips Hidden Valley Specialty Fat Free Food French", "relevancy_score": 175.22225454545452, "price": "$1.94"}, {"title": "Katz Gluten Free Donuts Glazed", "tags": "Dessert Breads All Cookies Gluten Free Pretzels Chocolate Gluten-Free Plant Based Snacks Crackers", "relevancy_score": 45.1248, "price": "$6.49"}, {"title": "Bumble Bee Snack On The Run! Ham Salad with Crackers, 3.5 oz Snack Kit, Good Source of Protein", "tags": "Tuna & Seafood All Grab and Go Sandwiches, Salads Snack Packs High Protein Food Staples Premade Canned Bumblebee Packaged Pouches", "relevancy_score": 61.10624680851064, "price": "$1.24"}, {"title": "Kellogg's Special K, Pastry Crisps, Caramel Latte, 12 Ct, 5.28 Oz", "tags": "Pop-Tarts & Toaster Pastries Fruity Breakfast Kellogg's Rice Krispies Treats Cereal Bars Granola Shop Nature Valley Snack", "relevancy_score": 79.94462608695653, "price": "$2.78"}, {"title": "(2 Pack) Victoria Pasta Sauce Slow Cooked Arrabbiata, 24.0 OZ", "tags": "Sauces All Meals and Sides Canned Tomatoes Pasta Sauce Vegan Foods Easy Kid's Dinners", "relevancy_score": 65.98026666666667, "price": "$6.75"}, {"title": "Hostess Chocolate Cake Twinkies, 10 count, 13.58 oz", "tags": "Snack Cakes & Cupcakes All Cookies Pastries Croissants and Breakfast", "relevancy_score": 43.1102, "price": "$11.99"}, {"title": "Fiber One 70 Calorie Chocolate Fudge Brownie, 6ct.", "tags": "Cereal Bars & Breakfast On the Go Snacks Granola Indulgent Fiber One Snack Gaming Drinks New Year You", "relevancy_score": 3184.2793163636366, "price": "$11.95"}, {"title": "La Banderita White Corn Tortillas, 80 ct", "tags": "Rolls & Buns All Fresh Fruit No Sugar Foods Bananas Gluten Free Low Sodium Vegan General Mills Box Tops Meals", "relevancy_score": 259.02352340425534, "price": "$2.98"}, {"title": "Wish-Bone House Italian Dressing 15 FL OZ", "tags": "Condiments Ranch Dressing Thousand Island Italian All Fresh Packaged Salads, Dressings and Dips Hidden Valley Fat Free Food & Marinades", "relevancy_score": 440.3750079999999, "price": "$1.94"}, {"title": "FISHER Chef's Naturals Walnut Halves & Pieces, 32 oz, Naturally Gluten Free, No Preservatives, Non-GMO", "tags": "Baking Nuts, Coconut & Fruit All Trail Mix,& Seeds Keto Snacks Nuts Planters Cashews Almonds Dried Fruits and Healthy", "relevancy_score": 1847.3190028985505, "price": "$12.52"}, {"title": "(3 Pack) Kraft Tangy Catalina with Bacon Dressing, 16 Fl Oz Bottle", "tags": "Condiments Ranch Dressing Thousand Island Italian All Fresh Packaged Salads, Dressings and Dips Caesar Fat Free Food French", "relevancy_score": 175.22225454545452, "price": "$6.36"}, {"title": "Frito-Lay Flamin' Hot Mix Variety Pack, 18 Count", "tags": "All Grab and Go Sandwiches, Salads Snack Packs Chips Study Snacks Lunchbox Favorites Gaming & Drinks Summer Grilling Variety Pack", "relevancy_score": 157.42613333333333, "price": "$6.48"}, {"title": "(12 Pack) Blue Dragon Spring Roll Wrappers, 4.7 Oz", "tags": "Tortillas, Pitas & Wraps Bread Crumbs Stuffing Rolls Buns Croutons Baguettes, Loaves Breadsticks Asian Rice, Grains Noodles Shop All Market", "relevancy_score": 15.6344, "price": "$26.55"}, {"title": "Atkins Gluten Free Protein-Rich Shake, Creamy Vanilla, Keto Friendly, 8 Count (Ready to Drink)", "tags": "Beach Body Ready Weight Management for Active Moms Restock Indulgent Flavors Mom Keto Basics Gain Supplements Drinks", "relevancy_score": 656.4382457831325, "price": "$11.48"}, {"title": "Pioneer Woman Four Cheese Pasta Sauce, 24 oz Jar", "tags": "Sauces Ranch Dressing All Meals and Sides Pasta Sauce Shop BBQ Summer Grilling Condiments Gluten Free & Side Dishes Easy Kid's Dinners", "relevancy_score": 403.50213333333335, "price": "$2.98"}, {"title": "Planters Cashew Halves & Pieces, Salted, 26 Ounce Jar", "tags": "All Nuts, Trail Mix,& Seeds Nuts Planters Cashews Dried Fruits and Healthy Snacks Mixed", "relevancy_score": 1047.9323114503816, "price": "$13.82"}, {"title": "Walden Farms Sugar Free Thousand Island Dressing, 12 fl oz", "tags": "Shop All Salad Dressings Ranch Dressing Sugar-Free Food Essentials Thousand Island Snacks Fresh Packaged Salads, and Dips Specialty", "relevancy_score": 277.4768, "price": "$3.12"}, {"title": "(3 Pack) Jell-O Island Pineapple Gelatin Mix, 3 oz Box", "tags": "Pie Fillings Valentine's Day Baking Sugar-Free Food Essentials Sugar Free All Mixes Chilled Gelatins Ingredients Easter", "relevancy_score": 685.17952, "price": "$1.94"}, {"title": "SNACK PACK Fanta Orange Juicy Gels Cups, 3.25 oz. Cups 6-Count", "tags": "Canned Fruit Applesauce Pudding & Gelatin Cups Sauces Chilled Puddings All Grab and Go Sandwiches, Salads Snack Packs Gelatins Dole", "relevancy_score": 121.6618, "price": "$2.48"}, {"title": "Great Value Organic Roasted & Salted Whole Cashews, 14 oz", "tags": "Baking Nuts, Coconut & Fruit Organic Foods All Trail Mix,& Seeds Planters Cashews Dried Fruits and Healthy Snacks Pistachios", "relevancy_score": 134.40353684210527, "price": "$8.68"}, {"title": "(3 Pack) Keebler Ready Crust 9 Inch Reduced Fat Graham Pie Crust 6 Oz", "tags": "Back to College Stock Up up on Cleaning Supplies Teenage Mutant Ninja Turtles Men's Clothing Baking Oral Care Laundry Room", "relevancy_score": 48.068799999999996, "price": "$5.95"}, {"title": "Mezzetta Delicate Marinara Pasta Sauce, Italian Plum tomato, 16.25 Oz", "tags": "All Meals and Sides Canned Tomatoes Pasta Sauce Vegan Foods Food Essentials Non GMO Gluten Free & Side Dishes Easy Kid's Dinners", "relevancy_score": 133.74383448275861, "price": "$3.98"}, {"title": "(4 pack) Campbell's Well Yes! Sipping Soup, Vegetable Soup On The Go, Broccoli & Sweet Potato, 11.1 Ounce Cup", "tags": "Stocks & Broths Soup Mixes All Meals and Sides Canned Tomatoes Cold Weather Foods Soups, Broth Non GMO Food", "relevancy_score": 1167.406845602606, "price": "$6.72"}, {"title": "Lipton, Cup-a-soup, Instant Soup, Chicken Noodle With White Meat", "tags": "", "relevancy_score": 704.6505202072539, "price": "$91.16"}, {"title": "(3 Pack) Lidestri Foods Francesco Rinaldi  Pasta Sauce, 24 oz", "tags": "Pasta & Noodles Sauces All Meals and Sides Canned Tomatoes Sauce Vegan Foods Gluten Free Side Dishes Easy Kid's Dinners", "relevancy_score": 638.4477999999999, "price": "$4.80"}, {"title": "Planters Mixed Nuts, 27.0 oz Jar", "tags": "All Nuts, Trail Mix,& Seeds On the Go Snacks Nuts Planters Cashews Dried Fruits and Healthy Mixed Wonderful Pistachios", "relevancy_score": 1375.7590693409743, "price": "$11.82"}, {"title": "Walden Farms Calorie Free Salad Dressing, Chipotle Ranch, 12 Oz", "tags": "Shop All Salad Dressings Ranch Dressing Sugar-Free Food Essentials Sugar Free Italian Snacks Fresh Packaged Salads, and Dips Balsamic", "relevancy_score": 209.13279999999997, "price": "$3.34"}, {"title": "Blue Diamond Habanero BBQ Almonds 30 oz. Bag", "tags": "All Nuts, Trail Mix,& Seeds On the Go Snacks Nuts Planters Cashews Almonds Dried Fruits and Healthy Roasted", "relevancy_score": 271.69168372093026, "price": "$11.68"}, {"title": "Goya Chipolte Peppers In Adobo Sauce, 7.0 Oz", "tags": "All Fresh Vegetables Canned Tomatoes Pasta Sauce Chipotle Peppers Snacks Green Chilis Bouillon", "relevancy_score": 25.940133333333335, "price": "$1.57"}, {"title": "Pioneer Woman Garden Vegetable Pasta Sauce, 24 oz Jar", "tags": "Sauces Ranch Dressing All Meals and Sides Canned Tomatoes Pasta Sauce Shop BBQ Gluten Free & Side Dishes Easy Kid's Dinners", "relevancy_score": 315.03844210526313, "price": "$2.98"}, {"title": "Premier Protein Shake, Chocolate, 30g Protein, 11 Fl Oz, 12 Ct", "tags": "Protein Shakes Eat High Diet Premier Shakes, Bars & Energy Drinks Fuel Your Body Add to Build Muscle Clears", "relevancy_score": 11245.388100632912, "price": "$23.74"}, {"title": "Coffee Cake Swirl Scented Wax Melts, ScentSationals, 5 oz", "tags": "Better Homes & Gardens Decor Yankee Candle Wax Melts Fall Indoor Shop All Candles Dorm", "relevancy_score": 104.72856470588236, "price": "$3.47"}, {"title": "(3 Pack) Peter Pan Crunchy Honey Roast Peanut Spread, 28 oz", "tags": "Skippy Peanut Butter Natural and Jelly All Chunky Jif Creamy", "relevancy_score": 319.85305, "price": "$9.75"}, {"title": "Premier Protein Shake, Chocolate, 30g Protein, 11.5 Fl Oz, 12 Ct", "tags": "Protein Shakes Premier Shakes, Bars & Energy Drinks Fuel Your Workout On the Go Body Clears", "relevancy_score": 11245.388100632912, "price": "$18.79"}, {"title": "Califia Farms Unsweetened Better Half Coconut Cream & Almond Milk Dairy Free Creamer, 32 oz", "tags": "Califia Non Dairy Creamers Powder Coffee Creamer New Year You Healthy Liquid Farms Keto", "relevancy_score": 295.4813714285714, "price": "$4.28"}, {"title": "Horizon Organic 1% Lowfat UHT Strawberry Milk, 8 Oz., 6 Count", "tags": "Organic Foods Chocolate Milk Almond DHA Plant-Based Horizon Plant Based Beverages", "relevancy_score": 183.19046666666665, "price": "$6.32"}, {"title": "Schar Sch'Nacks Chocolate Covered Snack Cakes, 12.3 Oz", "tags": "Cakes & Cupcakes All Cookies Chocolate Gluten-Free Gluten Free Snacks, Chips Snacks Plant Based Crackers", "relevancy_score": 70.0653, "price": "$5.48"}, {"title": "Country Farms bountiful beets powder, wholefood beet extract superfood,10.6 oz., 30 servings (packaging may vary)", "tags": "Super Greens Powder Country Farms Beetroot Beets Plant Based Superfoods Natural Alternatives Shop All", "relevancy_score": 575.6707190751445, "price": "$14.97"}, {"title": "Starburst Cherry Gelatin, 6 serve", "tags": "Pudding & Gelatin Valentine's Day Baking Chilled Puddings All Grab and Go Sandwiches, Salads Snack Packs Kosher Beverages Ingredients Powdered Drink Mix Easter", "relevancy_score": 29.540151351351348, "price": "$1.22"}, {"title": "(4 Pack) Annie Chun's Japanese Style Udon Soup Bowl, 5.9 oz", "tags": "Boxed Meals Soup Mixes All and Sides Cold Weather Foods Soups, Stocks & Broths Asian Rice, Grains Noodles Gluten-Free Food Staples Shop Market", "relevancy_score": 134.959175, "price": "$9.11"}, {"title": "ORCHARD VALLEY HARVEST Salad Toppers, Honey Roasted Sliced Almonds & Berries, 0.85 oz (Pack of 8), Non-GMO, No Artificial Ingredients", "tags": "Shop All Salad Dressings Nuts, Trail Mix,& Seeds Fresh Packaged Salads, and Dips Toppings Mix", "relevancy_score": 30.94015135135135, "price": "$5.98"}, {"title": "Nutiva Organic, non-GMO, Vegan Hazelnut Spread , Classic Chocolate, 13-ounce", "tags": "Organic Food Essentials Butter Peanut and Jelly Vegan Shop All Plant Based Foods Nutella", "relevancy_score": 234.9268909090909, "price": "$4.97"}, {"title": "Bar Harbor Chopped Clams, 6.5 Oz. Can", "tags": "All Soup High Protein Food Staples Low Sodium Seafood Fresh Fish Calorie Foods Bumblebee Tuna", "relevancy_score": 61.612981818181815, "price": "$19.99"}, {"title": "Moon Pie Double Decker Banana Marshmallow Sandwiches, 2.75 Oz., 12 Count", "tags": "Snack Cakes All Grab and Go Sandwiches, Salads Packs Cookies Keebler Chocolate Deli Sandwiches Summer Grilling Snacks", "relevancy_score": 690.124541935484, "price": "$4.58"}, {"title": "SNICKERS Chocolate Lowfat Milk 6-8 fl. oz. Bottles 48 fl oz.", "tags": "Chocolate Milk Organic Plant-Based Powders All Powdered Drink Mix Horizon Nestle Milo", "relevancy_score": 73.00624680851064, "price": "$5.98"}, {"title": "SKIPPY Reduced Fat Creamy Peanut Butter Spread, 40 Ounce", "tags": "Jam, Jelly & Preserves Skippy Peanut Butter Natural and All Jif Creamy", "relevancy_score": 3130.3648105680318, "price": "$5.44"}, {"title": "Peanut Butter And Co Peanut Butter Dark Chocolate Dreams, 16 Oz", "tags": "Peanut Butter and Jelly Powdered Butters All Cashew Shop Plant Based Foods Almond", "relevancy_score": 94.22856470588236, "price": "$12.47"}, {"title": "Gluten Free Bake Shoppe Katz Donuts, 10.5 oz", "tags": "Dessert Breads All Cookies Chocolate Chip Gluten-Free Plant Based Snacks Gluten Free Crackers", "relevancy_score": 24.6344, "price": "$6.49"}, {"title": "Sahale Snacks Honey Almonds Glazed Mix, Gluten-Free Snack, 4-Ounce Bag", "tags": "High Protein Snacks Trail Mixes and Healthy All Nuts, Mix,& Seeds Nuts Dried Fruits Mix", "relevancy_score": 1409.3358638297873, "price": "$3.88"}, {"title": "McCormick Gourmet Organic Toasted Seed Sesame, 1.37 oz", "tags": "Sunflower Seeds All Nuts, Trail Mix,& Single Herbs & Spices Pumpkin Dried Fruits and Healthy Snacks Salt, Seasoning", "relevancy_score": 20.52244705882353, "price": "$4.79"}, {"title": "(12 Pack) Sushi Chef Black Sesame Jobs, 3.75 Oz", "tags": "Taco Seasoning Chicken Popcorn All Single Herbs & Spices Steak Salt,", "relevancy_score": 30.740133333333333, "price": "$29.82"}, {"title": "(4 Pack) Libby's Vienna Sausage with Barbecue Sauce, 4.6 Ounce", "tags": "Tuna & Seafood Bacon Sausages All Canned Goods Beef Vienna chicken Bacon, Hot Dogs and Easy Kid's Dinners", "relevancy_score": 98.26180000000001, "price": "$4.90"}, {"title": "NIDO 3+ Powdered Milk Beverage", "tags": "All Baby Formula Food Stage 1 Toddler Cereal PediaSure Organic NIDO Supplementing & Nutrition", "relevancy_score": 730.5321617021276, "price": "$10.42"}, {"title": "(4 Pack) Smucker's Marshmallow Flavored Spoonable Ice Cream Topping,12.25 Oz", "tags": "Frosting, Toppings & Decorations Valentine's Day Baking Marshmallows Restock All Syrups Smucker's Hershey", "relevancy_score": 119.51854545454546, "price": "$7.45"}, {"title": "Premier Protein Shake, Vanilla, 30g Protein, 11.5 Fl Oz, 12 Ct", "tags": "Shakes High Protein Drinks On-The-Go & Electrolytes Functional Beverages New Year You Foods Weight Management", "relevancy_score": 5246.034135468374, "price": "$18.79"}, {"title": "Kikkoman Instant Shiro Miso Soybean Paste White Soup, 1.05 oz", "tags": "Beans Stocks & Broths Sauces Soup Mixes All Meals and Sides Asian Snacks Cold Weather Foods Shop Market", "relevancy_score": 15.403709090909091, "price": "$1.99"}, {"title": "Muscle Milk 100 Calorie Protein Shake, 20g Protein, Chocolate, 11 Fl Oz, 4 CountMuscle Milk 100 Calorie Protein Shake, 20g Protein, Chocolate, 11 Fl Oz, 4 Count", "tags": "Protein Shakes, Bars & Energy Drinks Fitness for Active Dads Fuel Your Workout On the Go Body Muscle Milk Shake Back to School Health Essentials", "relevancy_score": 368.4618265486726, "price": "$5.77"}, {"title": "Marinela Pinguinos Creme Filled Chocolate Cupcakes, 8 Snack Cakes", "tags": "All Cookies Shop Snack Packs Lunchbox Favorites Kellogg's Cakes Nutella", "relevancy_score": 24.740133333333333, "price": "$10.50"}, {"title": "(3 Pack) Ken's Steakhouse Dressing, Russian, 16 Fl Oz", "tags": "Ranch Dressing Thousand Island All Fresh Packaged Salads, Dressings and Dips Caesar Specialty French & Marinades", "relevancy_score": 67.21298181818182, "price": "$7.71"}, {"title": "Dole California Dates, Pitted, 8 oz", "tags": "Tropical Fruits Dried and Vegetables All Fruit Types Nuts, Healthy Snacks Dates Made in Nature New Organic", "relevancy_score": 486.52201379310344, "price": "$3.98"}, {"title": "Casa Sanchez Foods: Medium Salsa Roja, 15 Oz", "tags": "All Chilled Hummus, Dips and Salsas Fresh Packaged Salads, Dressings & Spreads Latin American Sauces, Condiments Cooking Needs", "relevancy_score": 0.0, "price": "$19.99"}, {"title": "(12 Pack) American Beauty Large Elbows 24 Oz Bag", "tags": "Sauces All Meals and Sides No Sugar Foods Nut Free Low Sodium Dairy Kosher Easy Kid's Dinners", "relevancy_score": 30.740133333333333, "price": "$18.72"}, {"title": "Sonic Banana Shake Pudding, 4 serve", "tags": "Pudding & Gelatin Cakes Cupcakes Pie Fillings Kosher Beverages Tea Bags Birthday Cake Mix Black Chilled Gelatins", "relevancy_score": 18.52244705882353, "price": "$1.16"}, {"title": "Tessemae's Organic No Sugar Added Cilantro Ranch Dressing & Marinade, 10 fl oz", "tags": "Shop All Salad Dressings Ranch Dressing Condiments & Fresh Packaged Salads, and Dips Primal Kitchen Specialty Dairy Free Foods Marinades", "relevancy_score": 338.94736310679605, "price": "$3.97"}, {"title": "(3 Pack) Good Seasons Italian with Cruet Salad Dressing & Recipe Mix, 2 - 0.7 Oz Boxes", "tags": "Shop All Salad Dressings Thousand Island Dressing Italian Fresh Packaged Salads, and Dips Hidden Valley Ranch Nut Free Foods Dairy & Marinades", "relevancy_score": 320.495103030303, "price": "$8.12"}, {"title": "(6 Pack) Lipton Onion Flavor Recipe Secrets Soup and Dip Mix 2 oz", "tags": "All Soup Hidden Valley Ranch Cold Weather Foods Chilled Dips Gravies & Spreads Condensed Vegetable", "relevancy_score": 159.09202580645163, "price": "$7.76"}, {"title": "(Pack of 6) Silk Shelf-Stable Unsweetened Vanilla Almondmilk, 1 Quart", "tags": "Plant Based Breakfast Foods Almond Milk Silk Plant-Based Unsweetened Baking Needs Beverages Breeze", "relevancy_score": 1164.8598469314081, "price": "$12.49"}, {"title": "Banza Gluten Free Deluxe Mac & Cheese with Elbow Chickpea Pasta + Classic Cheddar Cheese, 11 oz", "tags": "Macaroni and Cheese Better For You Food Essentials Shop All Gluten Free Foods Healthy Plant Based Pasta & Grains New Easy Kid's Dinners", "relevancy_score": 46.1102, "price": "$3.99"}, {"title": "Premier Protein Shake, Vanilla, 30g Protein, 11 Fl Oz, 12 Ct", "tags": "Eat High Protein Diet Premier Shakes Shakes, Bars & Energy Drinks On the Go Fuel Your Body Add to Build Muscle Clears", "relevancy_score": 5366.436474236491, "price": "$22.41"}, {"title": "Badia Cilantro, 0.25 Oz", "tags": "Organic Foods Food Essentials Garlic Powder All Single Herbs & Spices Salt, Seasoning", "relevancy_score": 10.27755, "price": "$0.98"}, {"title": "(6 Pack) Justin'S Nut Butter Peanut Butter - Honey, 28 Oz", "tags": "", "relevancy_score": 25.6344, "price": "$39.36"}, {"title": "Goya Goya  Red Kidney Beans, 14 oz", "tags": "Dried Beans All Fresh Vegetables Canned Tomatoes Baked Pasta Sauce Snacks High Fiber Foods", "relevancy_score": 11.503709090909092, "price": "$8.49"}, {"title": "Horizon Organic 1% Lowfat UHT Strawberry Milk, 8 Oz., 12 Count", "tags": "Organic Foods Chocolate Milk DHA Plant-Based Plant Based Baking Needs Horizon Beverages", "relevancy_score": 145.8912, "price": "$11.98"}, {"title": "Aroma One Organics Ginger Puree", "tags": "Oil & Shortening Herb Plants Garlic Powder All Single Herbs Spices Minced Salt, Seasoning Carrots and Root Vegetables", "relevancy_score": 1.1432516129032257, "price": "$9.99"}, {"title": "Core Power Protein Shake, Chocolate, 26g Protein 14 Fl Oz, 12 Count", "tags": "Healthy Meal Prep Stock up on Breakfast Snacks Wellness Clean Living Shop Baking Supplies Plant Based Products Diet Management Beauty & Grooming", "relevancy_score": 2569.21876, "price": "$30.23"}, {"title": "Premier Protein Shake, Peaches & Cream, 30g Protein, 11 Fl Oz, 12 Ct", "tags": "Protein Shakes Premier Shakes, Bars & Energy Drinks Fuel Your Workout Body Beach Ready - Active Nutrition Clears", "relevancy_score": 2203.7732819277107, "price": "$22.41"}, {"title": "Sun-Maid Organic Dried Mango Slices, 3 oz Bag", "tags": "Dried Fruits Mango All Fruit Types Nuts, and Healthy Snacks Raisins Sun-Maid Made in Nature Organic", "relevancy_score": 61.10624680851064, "price": "$3.10"}, {"title": "Equate Nutritional High Protein Shakes, Vanilla, 16 Count", "tags": "On-the-Go Nutrition Weight Management On the Go New and Trending Busy Lifestyle Formats Meal Replacement Shakes Equate Gain Supplements Gainers", "relevancy_score": 75.82194285714284, "price": "$15.97"}, {"title": "Silk Oat Yeah The Vanilla One Oatmilk, Half Gallon", "tags": "Chocolate Milk Organic Plant-Based Unsweetened Plant Based Baking Needs Oat Califia Farms Creamers Beverages", "relevancy_score": 433.416, "price": "$82.90"}, {"title": "Mrs. Renfro'S Ghost Pepper Salsa Pepper, 16 Oz", "tags": "Salty Snacks Stock-Up Tostitos Salsa Queso & Cheese Dips All Chilled Hummus, and Salsas Spreads", "relevancy_score": 30.740133333333333, "price": "$2.96"}, {"title": "El Ebro Cuban Style Black Beans, 15 oz", "tags": "All Soup Meals and Sides Fresh Vegetables Canned Black Beans Baked Cold Weather Foods Nut Free", "relevancy_score": 20.52244705882353, "price": "$9.98"}, {"title": "Premier Protein Shake, Cookies & Cream, 30g Protein, 11 Fl Oz, 12 Ct", "tags": "Gluten-Free Foods Shakes High Protein Drinks On-The-Go & Electrolytes New Year You Weight Management", "relevancy_score": 2212.179576470588, "price": "$22.27"}, {"title": "Wickles Spicy Red Sandwich Spread, 16 fl oz", "tags": "Chutneys & Relishes Crystal Light Powdered Drink Mixes All Baking Specialty Pickle Brands Summer Grilling Condiments Cream Cheese Spreads", "relevancy_score": 89.12194285714284, "price": "$11.90"}, {"title": "Finishing Touch Flawless, Replacement Heads for Original Facial Hair Remover, As Seen on TV", "tags": "Peanut Butter and Jelly Sticks Cream Cheese & Spreads", "relevancy_score": 518.7026028169014, "price": "$12.88"}, {"title": "Natrel Skim Shelf Stable Milk, 32 oz, 6 Pack", "tags": "Chocolate Milk Organic Whole Plant-Based Horizon Lactose Free Flavored Milks Plant Based Beverages", "relevancy_score": 92.92194285714285, "price": "$11.88"}, {"title": "ORCHARD VALLEY HARVEST Salad Toppers, Glazed Walnuts & Berries, 0.85 oz (Pack of 8), Non-GMO, No Artificial Ingredients", "tags": "Shop All Salad Dressings Nuts, Trail Mix,& Seeds Fresh Packaged Salads, and Dips Toppings Dried Fruits Healthy Snacks Mix", "relevancy_score": 247.77550000000002, "price": "$5.98"}, {"title": "Premier Protein Shake, Caramel, 30g Protein, 11.5 Fl Oz, 12 Ct", "tags": "Protein Shakes Premier Shakes, Bars & Energy Drinks Indulgent Flavors Fitness Fuel Your Workout On the Go Clears", "relevancy_score": 7414.95961535649, "price": "$22.41"}]